In [2]:
import pandas as pd

In [3]:
import numpy as np

In [180]:
#### creating dataframe

In [4]:
df = pd.DataFrame({'Name' : ['rohan', 'sunita', 'avni', 'komal'], 'age' : [28, 33, 18, 28], 'gender' : ['M', 'F', 'F', 'F']})

In [5]:
df

     Name  age gender
0   rohan   28      M
1  sunita   33      F
2    avni   18      F
3   komal   28      F

In [6]:
df.info

<bound method DataFrame.info of      Name  age gender
0   rohan   28      M
1  sunita   33      F
2    avni   18      F
3   komal   28      F>

In [7]:
df.describe()

             age
count   4.000000
mean   26.750000
std     6.291529
min    18.000000
25%    25.500000
50%    28.000000
75%    29.250000
max    33.000000

In [8]:
#### to know the column names

In [9]:
df.columns

Index(['Name', 'age', 'gender'], dtype='object')

In [10]:
df.keys()

Index(['Name', 'age', 'gender'], dtype='object')

In [11]:
#### to know values of specific column names

In [12]:
df['Name']

0     rohan
1    sunita
2      avni
3     komal
Name: Name, dtype: object

In [13]:
#### unique values of a column

In [14]:
df['age'].unique()

array([28, 33, 18], dtype=int64)

In [15]:
#### value counts

In [16]:
df['age'].value_counts()

age
28    2
33    1
18    1
Name: count, dtype: int64

In [17]:
#### renaming column name

In [18]:
df.rename({'Name': 'name'}, axis=1,inplace = True)

In [19]:
df

     name  age gender
0   rohan   28      M
1  sunita   33      F
2    avni   18      F
3   komal   28      F

In [20]:
#### Adding new column

In [21]:
df['city'] = ['Jdp', 'Bkn', 'Jpr', 'Ggn']

In [22]:
df

     name  age gender city
0   rohan   28      M  Jdp
1  sunita   33      F  Bkn
2    avni   18      F  Jpr
3   komal   28      F  Ggn

In [23]:
#### droping a column

In [24]:
df.drop('city', axis= 1, inplace = True)

In [25]:
df

     name  age gender
0   rohan   28      M
1  sunita   33      F
2    avni   18      F
3   komal   28      F

In [26]:
#### adding new column

In [27]:
def get_age_group(age):
    if age > 20:
        return 'A'
    else:
        return 'S'

In [28]:
df['age_group'] = df['age'].apply(get_age_group)

In [29]:
df

     name  age gender age_group
0   rohan   28      M         A
1  sunita   33      F         A
2    avni   18      F         S
3   komal   28      F         A

In [30]:
def name_length(name):
    return len(name)

In [31]:
df['name_length'] = df['name'].apply(name_length)

In [32]:
df

     name  age gender age_group  name_length
0   rohan   28      M         A            5
1  sunita   33      F         A            6
2    avni   18      F         S            4
3   komal   28      F         A            5

In [33]:
#### changing index

In [34]:
df.index.values

array([0, 1, 2, 3], dtype=int64)

In [35]:
df.index = range(1, df.shape[0]+1)  # changing range of index

In [36]:
df

     name  age gender age_group  name_length
1   rohan   28      M         A            5
2  sunita   33      F         A            6
3    avni   18      F         S            4
4   komal   28      F         A            5

In [37]:
df.set_index('name').index.values   # setting a column as index

array(['rohan', 'sunita', 'avni', 'komal'], dtype=object)

In [38]:
df.reset_index(inplace = True)    # resetting index

In [39]:
df

   index    name  age gender age_group  name_length
0      1   rohan   28      M         A            5
1      2  sunita   33      F         A            6
2      3    avni   18      F         S            4
3      4   komal   28      F         A            5

In [40]:
df.drop('index', axis = 1, inplace = True)

In [41]:
df

     name  age gender age_group  name_length
0   rohan   28      M         A            5
1  sunita   33      F         A            6
2    avni   18      F         S            4
3   komal   28      F         A            5

In [42]:
#### fetching values from index -- iloc vs loc

In [43]:
df.index = range(1, df.shape[0]+1)

In [44]:
df.drop('index', axis=1, inplace=True)

KeyError: "['index'] not found in axis"

In [45]:
df

     name  age gender age_group  name_length
1   rohan   28      M         A            5
2  sunita   33      F         A            6
3    avni   18      F         S            4
4   komal   28      F         A            5

In [46]:
df.iloc[0] # fetches data from original index

name           rohan
age               28
gender             M
age_group          A
name_length        5
Name: 1, dtype: object

In [47]:
df.loc[1]  # fetches data from new index

name           rohan
age               28
gender             M
age_group          A
name_length        5
Name: 1, dtype: object

In [48]:
df.set_index('name',inplace = True)

In [49]:
df

        age gender age_group  name_length
name
rohan    28      M         A            5
sunita   33      F         A            6
avni     18      F         S            4
komal    28      F         A            5

In [50]:
df.iloc[0]  # values at 0 index ie values of rohan

age            28
gender          M
age_group       A
name_length     5
Name: rohan, dtype: object

In [51]:
df.loc['rohan']

age            28
gender          M
age_group       A
name_length     5
Name: rohan, dtype: object

In [52]:
df.reset_index(inplace = True)

In [53]:
df

     name  age gender age_group  name_length
0   rohan   28      M         A            5
1  sunita   33      F         A            6
2    avni   18      F         S            4
3   komal   28      F         A            5

In [54]:
#### Adding new rows

In [57]:
df.iloc[len(df.index)-1] = ['sagar', '29', 'M', 'A', '5']

In [58]:
df

     name age gender age_group name_length
0   rohan  28      M         A           5
1  sunita  33      F         A           6
2    avni  18      F         S           4
3   sagar  29      M         A           5

In [60]:
df.loc[len(df.index)] = ['komal', '28', 'F', 'A', '5']

In [61]:
df

     name age gender age_group name_length
0   rohan  28      M         A           5
1  sunita  33      F         A           6
2    avni  18      F         S           4
3   sagar  29      M         A           5
4   komal  28      F         A           5

In [66]:
df.iloc[len(df.index)-1]

name           komal
age               28
gender             F
age_group          A
name_length        5
Name: 4, dtype: object

In [67]:
#### Finding duplicate values

In [68]:
df.loc[len(df.index)-1] = ['sagar', '29', 'M', 'A', '5']

In [69]:
df.loc[len(df.index)] = ['komal', '28', 'F', 'A', '5']

In [71]:
df.loc[len(df.index)] = ['komal', '28', 'F', 'A', '5']

In [72]:
df

     name age gender age_group name_length
0   rohan  28      M         A           5
1  sunita  33      F         A           6
2    avni  18      F         S           4
3   sagar  29      M         A           5
4   sagar  29      M         A           5
5   komal  28      F         A           5
6   komal  28      F         A           5

In [74]:
df[df.duplicated()]

    name age gender age_group name_length
4  sagar  29      M         A           5
6  komal  28      F         A           5

In [75]:
#### dropping duplicates

In [77]:
df.drop_duplicates(keep = 'first', inplace = True)

In [78]:
df

     name age gender age_group name_length
0   rohan  28      M         A           5
1  sunita  33      F         A           6
2    avni  18      F         S           4
3   sagar  29      M         A           5
5   komal  28      F         A           5

In [79]:
#### Sorting values

In [83]:
df['age'] = df['age'].astype('int')

In [85]:
df['name_length'] = df['name_length'].astype('int')

In [86]:
df.dtypes

name           object
age             int32
gender         object
age_group      object
name_length     int32
dtype: object

In [88]:
df.sort_values(by = 'age', ascending = False, inplace = True)

In [89]:
df

     name  age gender age_group  name_length
1  sunita   33      F         A            6
3   sagar   29      M         A            5
0   rohan   28      M         A            5
5   komal   28      F         A            5
2    avni   18      F         S            4

In [93]:
df.reset_index(inplace = True)

In [95]:
df.drop('index', axis = 1, inplace = True)

In [96]:
df

     name  age gender age_group  name_length
0  sunita   33      F         A            6
1   sagar   29      M         A            5
2   rohan   28      M         A            5
3   komal   28      F         A            5
4    avni   18      F         S            4

In [98]:
#### Corelating two dataframes

In [99]:
df1 = pd.DataFrame({'Staff': ['sunita', 'rohan', 'hari'], 'salary' : [50000, 37000, 60000]})

In [100]:
df1

    Staff  salary
0  sunita   50000
1   rohan   37000
2    hari   60000

In [107]:
df[df['name'].isin(df1['Staff'])]

     name  age gender age_group  name_length
0  sunita   33      F         A            6
2   rohan   28      M         A            5

In [108]:
#### join

In [111]:
df = df.merge(df1, left_on = 'name', right_on = 'Staff', how = 'left')

In [112]:
df

     name  age gender age_group  name_length   Staff   salary
0  sunita   33      F         A            6  sunita  50000.0
1   sagar   29      M         A            5     NaN      NaN
2   rohan   28      M         A            5   rohan  37000.0
3   komal   28      F         A            5     NaN      NaN
4    avni   18      F         S            4     NaN      NaN

In [113]:
df.drop('Staff', axis = 1, inplace =True)

df

In [115]:
#### encoding

In [116]:
def encode(gender):
    if gender == 'M':
        return 1
    else:
        return 0

In [118]:
df['gender'] = df['gender'].apply(encode)

In [119]:
df

     name  age  gender age_group  name_length   salary
0  sunita   33       0         A            6  50000.0
1   sagar   29       1         A            5      NaN
2   rohan   28       1         A            5  37000.0
3   komal   28       0         A            5      NaN
4    avni   18       0         S            4      NaN

In [126]:
#### creating new column using calculation

In [120]:
def salary_group(salary):
    if salary > 40000:
        return '>40000'
    else:
        return '<40000'

In [121]:
df['salary_group'] = df['salary'].apply(salary_group)

In [122]:
df

     name  age  gender age_group  name_length   salary salary_group
0  sunita   33       0         A            6  50000.0       >40000
1   sagar   29       1         A            5      NaN       <40000
2   rohan   28       1         A            5  37000.0       <40000
3   komal   28       0         A            5      NaN       <40000
4    avni   18       0         S            4      NaN       <40000

In [123]:
def tax(salary_group):
    if salary_group == '>40000':
        return 1
    else:
        return 0

In [124]:
df['tax'] = df['salary_group'].apply(tax)

In [125]:
df

     name  age  gender age_group  name_length   salary salary_group  tax
0  sunita   33       0         A            6  50000.0       >40000    1
1   sagar   29       1         A            5      NaN       <40000    0
2   rohan   28       1         A            5  37000.0       <40000    0
3   komal   28       0         A            5      NaN       <40000    0
4    avni   18       0         S            4      NaN       <40000    0

In [127]:
#### group

In [131]:
df.groupby('gender')

In [132]:
df.groupby('gender').ngroups

2

In [134]:
df.groupby('gender').groups

{0: [0, 3, 4], 1: [1, 2]}

In [139]:
df.groupby('age_group').get_group('A')

     name  age  gender age_group  name_length   salary salary_group  tax
0  sunita   33       0         A            6  50000.0       >40000    1
1   sagar   29       1         A            5      NaN       <40000    0
2   rohan   28       1         A            5  37000.0       <40000    0
3   komal   28       0         A            5      NaN       <40000    0

In [141]:
df.groupby('salary_group').get_group('<40000')

    name  age  gender age_group  name_length   salary salary_group  tax
1  sagar   29       1         A            5      NaN       <40000    0
2  rohan   28       1         A            5  37000.0       <40000    0
3  komal   28       0         A            5      NaN       <40000    0
4   avni   18       0         S            4      NaN       <40000    0

In [143]:
df.groupby('age_group')['salary_group'].count()

age_group
A    4
S    1
Name: salary_group, dtype: int64

In [144]:
#### multi indexing

In [150]:
df = pd.DataFrame({'Actor': ['Shahrukh', 'John', 'Salman', 'Salman', 'Salman', 'Amir', 'John', 'Hritik'], 
                   'movie_name' : ['Chakde India', 'Dhoom', 'Tiger', 'Tiger3', 'dabang', '3 Idiots', 'Force', 'Dhoom 2'], 
                 'year' : [2003, 2015, 2012, 2003, 2015, 2017, 2001, 2006]})

In [152]:
df['title'] = ['Love', 'Love', 'Action', 'Thrill', 'Horror', 'Action', 'Horror', 'Love']

In [153]:
df

      Actor    movie_name  year   title
0  Shahrukh  Chakde India  2003    Love
1      John         Dhoom  2015    Love
2    Salman         Tiger  2012  Action
3    Salman        Tiger3  2003  Thrill
4    Salman        dabang  2015  Horror
5      Amir      3 Idiots  2017  Action
6      John         Force  2001  Horror
7    Hritik       Dhoom 2  2006    Love

In [158]:
df.groupby('title').groups

{'Action': [2, 5], 'Horror': [4, 6], 'Love': [0, 1, 7], 'Thrill': [3]}

In [159]:
df.groupby('title')['movie_name'].count()

title
Action    2
Horror    2
Love      3
Thrill    1
Name: movie_name, dtype: int64

In [160]:
df.groupby('Actor')['year'].aggregate(min)

Actor
Amir        2017
Hritik      2006
John        2001
Salman      2003
Shahrukh    2003
Name: year, dtype: int64

In [163]:
df.groupby('Actor').aggregate({'title' : 'count', 'year' : ['min', 'max']})

         title  year
         count   min   max
Actor
Amir         1  2017  2017
Hritik       1  2006  2006
John         2  2001  2015
Salman       3  2003  2015
Shahrukh     1  2003  2003

In [167]:
df.groupby('Actor')['movie_name'].count().reset_index()

      Actor  movie_name
0      Amir           1
1    Hritik           1
2      John           2
3    Salman           3
4  Shahrukh           1

In [168]:
#### melt and pivot

In [169]:
df = pd.DataFrame({'Name': {0: 'John', 1: 'Bob', 2: 'Shiela'},
                   'Course': {0: 'Masters', 1: 'Graduate', 2: 'Graduate'},
                   'Age': {0: 27, 1: 23, 2: 21}})

In [173]:
df

     Name    Course  Age
0    John   Masters   27
1     Bob  Graduate   23
2  Shiela  Graduate   21

In [174]:
pd.melt(df, id_vars = 'Name')

     Name variable     value
0    John   Course   Masters
1     Bob   Course  Graduate
2  Shiela   Course  Graduate
3    John      Age        27
4     Bob      Age        23
5  Shiela      Age        21

In [175]:
pd.melt(df, id_vars = 'Name', value_vars = 'Course')

     Name variable     value
0    John   Course   Masters
1     Bob   Course  Graduate
2  Shiela   Course  Graduate

In [176]:
pd.melt(df, id_vars = 'Name', value_vars = ['Course', 'Age'])

     Name variable     value
0    John   Course   Masters
1     Bob   Course  Graduate
2  Shiela   Course  Graduate
3    John      Age        27
4     Bob      Age        23
5  Shiela      Age        21

In [177]:
pd.melt(df, id_vars = 'Name', value_vars = ['Course', 'Age'], var_name = 'Variable_name_changed')

     Name Variable_name_changed     value
0    John                Course   Masters
1     Bob                Course  Graduate
2  Shiela                Course  Graduate
3    John                   Age        27
4     Bob                   Age        23
5  Shiela                   Age        21

In [187]:
df_melt = pd.melt(df, id_vars = 'Name', value_vars = ['Course', 'Age'], var_name = 'Variable_name_changed', value_name = 'Value_name_changed', ignore_index  = True)

In [188]:
df_melt

     Name Variable_name_changed Value_name_changed
0    John                Course            Masters
1     Bob                Course           Graduate
2  Shiela                Course           Graduate
3    John                   Age                 27
4     Bob                   Age                 23
5  Shiela                   Age                 21

In [189]:
df_melt.groupby('Variable_name_changed')['Value_name_changed'].count()

Variable_name_changed
Age       3
Course    3
Name: Value_name_changed, dtype: int64

In [198]:
pd.pivot(df_melt,index = 'Name', columns = ['Variable_name_changed'])

                      Value_name_changed
Variable_name_changed                Age    Course
Name
Bob                                   23  Graduate
John                                  27   Masters
Shiela                                21  Graduate

In [199]:
#### finding null values

In [175]:
df = pd.DataFrame({'alphabets' : ['a','m', 's', 'r', 't', 'e'], 'place' : [1, np.nan, 19, np.nan, 20, np.nan]})

In [176]:
df

  alphabets  place
0         a    1.0
1         m    NaN
2         s   19.0
3         r    NaN
4         t   20.0
5         e    NaN

In [177]:
df.isnull().sum()

alphabets    0
place        3
dtype: int64

In [178]:
df.isnull().sum().sum()   # total null values of the dataframe

3

In [179]:
df.loc[[3]].isna().sum().sum()  # total null values in 4th row

1

In [228]:
df.dropna()

  alphabets  place
0         a    1.0
2         s   19.0
4         t   20.0

In [232]:
df['place']=df['place'].fillna(0)
df['place']=df['place'].astype('int')

In [235]:
df['place'] = df['place'].replace(0, df['place'].mean())
df

  alphabets      place
0         a   1.000000
1         m   6.666667
2         s  19.000000
3         r   6.666667
4         t  20.000000
5         e   6.666667

In [221]:
df = pd.DataFrame({'G1': [10, 20, 30, 40],
            'G2': [25, np.NaN, np.NaN, 29],
            'G3': [15, 14, 17, 11],
            'G4': [21, 22, 23, 25]})

In [222]:
df

   G1    G2  G3  G4
0  10  25.0  15  21
1  20   NaN  14  22
2  30   NaN  17  23
3  40  29.0  11  25

In [223]:
df.isnull().sum()

G1    0
G2    2
G3    0
G4    0
dtype: int64

In [224]:
df.fillna(value = df['G2'].mean())

   G1    G2  G3  G4
0  10  25.0  15  21
1  20  27.0  14  22
2  30  27.0  17  23
3  40  29.0  11  25

In [236]:
#### pd.cut

In [248]:
df = pd.DataFrame({'number': np.random.randint(1, 100, 10)})

In [249]:
df

   number
0       2
1      37
2      73
3      38
4      57
5      69
6      91
7      90
8      45
9      22

In [250]:
df['bins'] = pd.cut(x = df['number'], bins = [1, 20, 40, 60, 80, 100], 
                    labels = ['1 to 20', '21 to 40', '41 to 60','61 to 80', '81 to 100'])

In [251]:
df

   number       bins
0       2    1 to 20
1      37   21 to 40
2      73   61 to 80
3      38   21 to 40
4      57   41 to 60
5      69   61 to 80
6      91  81 to 100
7      90  81 to 100
8      45   41 to 60
9      22   21 to 40

In [18]:
''' Question
You are given the raw data in form of a string, Write a function which can take a string as an input and return the unique 
words and the corresponding frequency in form of a Pandas Series object. The indices of the series should be the unique words 
and the values should be the frequency of those unique words.
'''

' You are given the raw data in form of a string, Write a function which can take a string as an \ninput and return the unique words and the corresponding frequency in form of a Pandas Series object.\nThe indices of the series should be the unique words and the values should be the frequency of those \nunique words.\n\n'

In [13]:
def string(x):
    ans = pd.Series(x.split()).value_counts()
    return ans

In [16]:
x = 'How much wood would a woodchuck chuck if a woodchuck could chuck wood'

In [17]:
string(x)

wood         2
a            2
woodchuck    2
chuck        2
How          1
much         1
would        1
if           1
could        1
Name: count, dtype: int64

In [67]:
''' Question
Given a dataframe containing employee income information,

Calculate and return the percentage of employees in medium income bracket.
'''

'\nGiven a dataframe containing employee income information,\n\nCalculate and return the percentage of employees in medium income bracket.\n'

In [19]:
data = {
    'name': ['Bruno', 'Ariana', 'Harry', 'Selena', 'Weeknd'],
    'gender': ['M', 'F', 'M', 'F', 'M'],
    'income': ['low', 'high', 'medium', 'medium', 'medium']
}

df = pd.DataFrame(data)

In [20]:
df

     name gender  income
0   Bruno      M     low
1  Ariana      F    high
2   Harry      M  medium
3  Selena      F  medium
4  Weeknd      M  medium

In [66]:
len(df.loc[df['income'] == 'medium'] ) / df.shape[0] * 100

60.0

In [64]:
df.shape[0]

5

In [69]:
'''Question
Return a dataframe consisting of records where the population is greater than 10 million.

The dataframe should be sorted in ascending order, first by year and then by population column.
'''

'Question\nReturn a dataframe consisting of records where the population is greater than 10 million.\n\nThe dataframe should be sorted in ascending order, first by year and then by population column.\n'

In [68]:
data = {
    'Country': ['Afghanistan', 'Australia', 'Brazil', 'China', 'France', 'India', 'United States'],
    'Year':  [1952, 1957, 1962, 1957, 1957, 1952, 1957],
    'Population':  [8425333.0, 9712569.0, 76039390.0, 637408000.0, 44310863.0, 372000000.0,  171984000.0],
    'Continent':  ['Asia', 'Oceania', 'Americas', 'Asia', 'Europe', 'Asia', 'Americas']
}

df = pd.DataFrame(data)

In [70]:
df

         Country  Year   Population Continent
0    Afghanistan  1952    8425333.0      Asia
1      Australia  1957    9712569.0   Oceania
2         Brazil  1962   76039390.0  Americas
3          China  1957  637408000.0      Asia
4         France  1957   44310863.0    Europe
5          India  1952  372000000.0      Asia
6  United States  1957  171984000.0  Americas

In [75]:
df[df['Population'] > 10000000].sort_values(by = ['Year','Population'], ascending = True)

         Country  Year   Population Continent
5          India  1952  372000000.0      Asia
4         France  1957   44310863.0    Europe
6  United States  1957  171984000.0  Americas
3          China  1957  637408000.0      Asia
2         Brazil  1962   76039390.0  Americas

In [79]:
''' Question
Tests were taken in two sets 1 and 2. Names of the students who participated in the respective tests are given. 
Marks are recorded according to the subjects, names, and tests.

df1 and df2 contain test1 and test2 respectively.

You are required to return the following:

1. The average Chemistry score of students from both the dataframes.
2. The average score across all the subjects for students who participated in both sets of exams 
(here all subjects of both the exams have to be considered together).
'''

' Question\nTests were taken in two sets 1 and 2. Names of the students who participated in the respective tests are given. \nMarks are recorded according to the subjects, names, and tests.\n\ndf1 and df2 contain test1 and test2 respectively.\n\nYou are required to return the following:\n\nThe average Chemistry score of students from both the dataframes.\nThe average score across all the subjects for students who participated in both sets of exams \n(here all subjects of both the exams have to be considered together).\n'

In [76]:
df1 = pd.DataFrame({"name": ['tobey', 'peter', 'chris', 'pratt'],
                    'chem_score':[10, 9, 8, 7], 'phy_score':[7, 8, 9, 10], 
                    'Hindi_score':[9, 9, 9, 9]})  
df2 = pd.DataFrame({"name": ['chris', 'pratt', 'andrew', 'tom'],
                    'chem_score':[10, 10, 10, 9], 'maths_score':[6, 6, 7, 9], 
                    'eng_score':[9, 10, 10, 9]})

In [77]:
df1

    name  chem_score  phy_score  Hindi_score
0  tobey          10          7            9
1  peter           9          8            9
2  chris           8          9            9
3  pratt           7         10            9

In [78]:
df2

     name  chem_score  maths_score  eng_score
0   chris          10            6          9
1   pratt          10            6         10
2  andrew          10            7         10
3     tom           9            9          9

In [86]:
ans = (df1['chem_score'].mean() + df2['chem_score'].mean())/2
ans

9.125

In [91]:
df3 = df1.merge(df2, on= ['name'])

In [92]:
df3

,name,chem_score_x,phy_score,Hindi_score,chem_score_y,maths_score,eng_score
0,chris,8,9,9,10,6,9
1,pratt,7,10,9,10,6,10

In [100]:
df3['chem_score_x'].mean()

7.5

In [102]:
df3.set_index('name', inplace = True)

In [104]:
lst = []
for i in df3.columns:
    ans = df3[i].mean()
    lst.append(ans)

In [105]:
lst  ## average subject marks for students who participated in both test

[7.5, 9.5, 9.0, 10.0, 6.0, 9.5]

In [106]:
df3

,chem_score_x,phy_score,Hindi_score,chem_score_y,maths_score,eng_score
name,,,,,,
chris,8,9,9,10,6,9
pratt,7,10,9,10,6,10

In [111]:
lst = []     ### average score across all the subjects for the students who participated in both the test
for i in df3.index:
    ans = df3.loc[i].mean()
    lst.append(ans)
print(lst)

[8.5, 8.666666666666666]

In [113]:
'''Question
Given a dataframe consisting of payments data of candidates,

1. Calculates the mean payment rounded off to 2 decimals for each candidate and stores it in a column avg_payment and

2. Returns the data frame after deleting all the columns other than 'name', 'mar_payment', and 'avg_payment'
'''

"Question\nGiven a dataframe consisting of payments data of candidates,\n\n1. Calculates the mean payment rounded off to 2 decimals for each candidate and stores it in a column avg_payment and\n\n2. Returns the data frame after deleting all the columns other than 'name', 'mar_payment', and 'avg_payment'\n"

In [122]:
data = {
    'name': ['a', 'b', 'c', 'd', 'e'],
    'jan_payment':  [10, 12, 13, 14, 15],
    'feb_payment':  [11, 11, 11, 11, 11],
    'mar_payment':  [100, 120, 130, 130, 140]
}

df = pd.DataFrame(data)
df

  name  jan_payment  feb_payment  mar_payment
0    a           10           11          100
1    b           12           11          120
2    c           13           11          130
3    d           14           11          130
4    e           15           11          140

In [123]:
df.set_index('name', inplace = True)
df

      jan_payment  feb_payment  mar_payment
name
a              10           11          100
b              12           11          120
c              13           11          130
d              14           11          130
e              15           11          140

In [130]:
lst = []
for i in df.index:
    ans = df.loc[i].mean().round(2)
    lst.append(ans)
lst

[40.33, 47.67, 51.33, 51.67, 55.33]

In [135]:
df['avg_payment'] = lst

In [136]:
df

      jan_payment  feb_payment  mar_payment  avg_payment
name
a              10           11          100        40.33
b              12           11          120        47.67
c              13           11          130        51.33
d              14           11          130        51.67
e              15           11          140        55.33

In [137]:
df.drop(['jan_payment','feb_payment'], axis=1, inplace = True)

In [138]:
df

      mar_payment  avg_payment
name
a             100        40.33
b             120        47.67
c             130        51.33
d             130        51.67
e             140        55.33

In [140]:
'''Question
Given a dataframe consisting of income details,

Return the name of person having the highest income.
'''

'Question\nGiven a dataframe consisting of income details,\n\nReturn the name of person having the highest income.\n'

In [139]:
data = {
    'name': ['Elon', 'Jeff', 'Bill', 'Falguni'],
    'gender': ['M', 'F', 'M', 'F'],
    'income': [53000, 28000, 25000, 44000]
}

df = pd.DataFrame(data)

In [141]:
df

      name gender  income
0     Elon      M   53000
1     Jeff      F   28000
2     Bill      M   25000
3  Falguni      F   44000

In [148]:
res = df.sort_values(by = 'income', ascending = False)   # method 1
ans = res.loc[0]['name']
ans

'Elon'

In [153]:
df['name'].loc[df['income'] == df['income'].max()].to_string(index = False)  # method 2

'Elon'

In [154]:
'''Question:
You're given a record of students with their registration dates and registration IDs.

You're also given the marks scored by each student in Physics, Chemistry, and Mathematics.

You need to find out the average marks by the students who registered on or after 01/05/2014 i.e. May 1st, 2014.

Return a list with the corresponding register IDs of the students sorted by their average marks in all three subjects 
in increasing order.

'''

"Question:\nYou're given a record of students with their registration dates and registration IDs.\n\nYou're also given the marks scored by each student in Physics, Chemistry, and Mathematics.\n\nYou need to find out the average marks by the students who registered on or after 01/05/2014 i.e. May 1st, 2014.\n\nReturn a list with the corresponding register IDs of the students sorted by their average marks in all three subjects \nin increasing order.\n\n"

In [155]:
df = pd.DataFrame({'dates':["2015-12-06", "2011-12-27", "2015-09-07", "2012-12-21", "2020-02-13"], 
                   'RID':[498, 721, 375, 464, 813], 
                   'Phy':[22, 45, 1, 65, 22], 
                   'Chem':[52, 56, 32, 50, 24], 
                   'Math':[63, 37, 68, 62, 43]})

In [156]:
df

        dates  RID  Phy  Chem  Math
0  2015-12-06  498   22    52    63
1  2011-12-27  721   45    56    37
2  2015-09-07  375    1    32    68
3  2012-12-21  464   65    50    62
4  2020-02-13  813   22    24    43

In [162]:
df['dates'] = pd.to_datetime(df['dates'])

In [163]:
df.dtypes

dates    datetime64[ns]
RID               int64
Phy               int64
Chem              int64
Math              int64
dtype: object

In [164]:
filtered_dates = df[df['dates'] >'01/05/2014' ]

In [173]:
avg = filtered_dates[['Phy', 'Chem', 'Math']].mean(axis = 1).round(2)
avg

0    45.67
2    33.67
4    29.67
dtype: float64

In [174]:
filtered_dates['avg'] = avg

C:\Users\ROHAN\AppData\Local\Temp\ipykernel_11148\1110925525.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  filtered_dates['avg'] = avg

In [179]:
res = filtered_dates.sort_values(by='avg', ascending = True)
res[['RID']]

   RID
4  813
2  375
0  498

In [181]:
'''Question:
Given two dataframes df1 (containing details of customer) and df2 (having details of orders),

Merge the dataframes such that resultant dataframe contains records for customer ids which are common in both dataframes.
'''

'Question:\nGiven two dataframes df1 (containing details of customer) and df2 (having details of orders),\n\nMerge the dataframes such that resultant dataframe contains records for customer ids which are common in both dataframes.\n'

In [182]:
df1 = pd.DataFrame({
    'cust_id': [101, 102, 103, 104],
    'name': ['rick', 'morty', 'pickle', 'jerry']})

df2 = pd.DataFrame({
    'order_id': ['OR1', 'OR3', 'OR23', 'OR42'],
    'cust_id': [102, 105, 101, 102],
    'amount': [1200, 650, 120, 989]})

In [183]:
df1

   cust_id    name
0      101    rick
1      102   morty
2      103  pickle
3      104   jerry

In [184]:
df2

  order_id  cust_id  amount
0      OR1      102    1200
1      OR3      105     650
2     OR23      101     120
3     OR42      102     989

In [185]:
df3 = df1.merge(df2, on = 'cust_id', how = 'inner')

In [186]:
df3

   cust_id   name order_id  amount
0      101   rick     OR23     120
1      102  morty      OR1    1200
2      102  morty     OR42     989

In [187]:
'''Question:
Given two dataframes customer (containing details of customer) and orders (having details of orders).

Also, name is given which is a customer's name.

Perform the following operation:

Merge the dataframe such that the resultant dataframe should contain records of all customer ids present in customer dataframe.

Calculate the total order amount for given customer name

Return the merged dataframe and the sum amount.

'''

"Question:\nGiven two dataframes customer (containing details of customer) and orders (having details of orders).\n\nAlso, name is given which is a customer's name.\n\nPerform the following operation:\n\nMerge the dataframe such that the resultant dataframe should contain records of all customer ids present in customer dataframe.\n\nCalculate the total order amount for given customer name\n\nReturn the merged dataframe and the sum amount.\n\n"

In [188]:
data = {
    'cust_id': [101, 102, 103, 104],
    'name': ['rick', 'morty', 'pickle', 'jerry']
}

customer = pd.DataFrame(data)

In [189]:
data = {
    'order_id': ['OR1', 'OR3', 'OR23', 'OR42'],
    'cust_id': [102, 105, 101, 102],
    'amount': [1200, 650, 120, 989]
}

orders = pd.DataFrame(data)

In [190]:
customer

   cust_id    name
0      101    rick
1      102   morty
2      103  pickle
3      104   jerry

In [191]:
orders

  order_id  cust_id  amount
0      OR1      102    1200
1      OR3      105     650
2     OR23      101     120
3     OR42      102     989

In [194]:
df3 = customer.merge(orders, on = 'cust_id', how = 'left')
df3

   cust_id    name order_id  amount
0      101    rick     OR23   120.0
1      102   morty      OR1  1200.0
2      102   morty     OR42   989.0
3      103  pickle      NaN     NaN
4      104   jerry      NaN     NaN

In [209]:
lst = []
for i in df3.name.values:
    amt  = df3.loc[df3['name'] == i]['amount'].sum()
    lst.append(amt)
print(lst)

[120.0, 2189.0, 2189.0, 0.0, 0.0]

In [210]:
df3['total'] = lst

In [211]:
df3

   cust_id    name order_id  amount   total
0      101    rick     OR23   120.0   120.0
1      102   morty      OR1  1200.0  2189.0
2      102   morty     OR42   989.0  2189.0
3      103  pickle      NaN     NaN     0.0
4      104   jerry      NaN     NaN     0.0

In [242]:
res = df3[df3['total'] == df3['total'].max()]

In [250]:
res

   cust_id   name order_id  amount   total
1      102  morty      OR1  1200.0  2189.0
2      102  morty     OR42   989.0  2189.0

In [ ]:
'''Question
Merge the two dataframes 
'''

In [4]:
df1 = pd.DataFrame({'name': ['Jack','Ryan','Chris','Sam'],
'rank': [1, 2, 3, 4]})
df2 = pd.DataFrame({'name': ['Ryan', 'Sam', 'Chris', 'Jack'],
'rank': [3, 1, 4, 2]})

print(pd.merge(df1, df2, on="name"))

    name  rank_x  rank_y
0   Jack       1       2
1   Ryan       2       3
2  Chris       3       4
3    Sam       4       1

In [ ]:
'''Question:
df.isin() use case
'''

In [5]:
data = {
    'cust_id': [101, 102, 103, 104],
    'name': ['rick', 'morty', 'pickle', 'jerry'],
}

df = pd.DataFrame(data)

In [6]:
df

   cust_id    name
0      101    rick
1      102   morty
2      103  pickle
3      104   jerry

In [9]:
df.isin('rick')  ### Error bcz only list like or dict like objects are allowed to be passed in a DF.isin(), str not allowed

TypeError: only list-like or dict-like objects are allowed to be passed to DataFrame.isin(), you passed a 'str'

In [11]:
'''Question
Given a dataframe df having the income details for different individuals.

Return a Series that contains the gender-wise average income.
'''

'Question\nGiven a dataframe df having the income details for different individuals.\n\nReturn a Series that contains the gender-wise average income.\n'

In [10]:
data = {
    'name': ['Elon', 'Jeff', 'Bill', 'Falguni'],
    'gender': ['M', 'F', 'M', 'F'],
    'income': [53000.0, 28000.0, 25000.0, 44000.0]
}

df = pd.DataFrame(data)

In [12]:
df

      name gender   income
0     Elon      M  53000.0
1     Jeff      F  28000.0
2     Bill      M  25000.0
3  Falguni      F  44000.0

In [14]:
df.groupby('gender')['income'].mean()

gender
F    36000.0
M    39000.0
Name: income, dtype: float64

In [15]:
'''Question
We have access to Amazon's sales data.

Our objective is to filter out user users who have purchased a minimum of 'x' quantity of items and ensure that the average price of the items they've bought is at least 'y'.

Values of x and y will be provided to the function.
'''

"Question\nWe have access to Amazon's sales data.\n\nOur objective is to filter out user users who have purchased a minimum of 'x' quantity of items and ensure that the average price of the items they've bought is at least 'y'.\n\nValues of x and y will be provided to the function.\n"

In [18]:
data = {
    'Name': ['Julie Dsouza', 'Kelly Sebastian', 'Daniel Fernandez', 'Julie Dsouza', 'John Jacob'],
    'Product': ['Apple Airpods Headphones', 'Apple Airpods Headphones', '27in 4K Gaming Monitor', 
                'Bose SoundSport Headphones', 'Wired Headphones'],
    'Quantity Ordered': [1, 1, 1, 1, 2],
    'Price Each': [150.00, 150.00, 389.99, 99.99, 11.99],
    'Order Date': ['01/22/19 21:20', '01/24/19 8:13', '01/26/19 12:16', '01/01/19 10:30', '01/17/19 13:33'],
    'Purchase Address': ['868 Willow St, Los Angeles, CA 90001', '442 Cedar St, Portland, OR 97035', 
                         '741 10th St, Los Angeles, CA 90001', '867 Willow St, Los Angeles, CA 90001', 
                         '946 Walnut St, Boston, MA 02215']
}

df = pd.DataFrame(data)

In [17]:
df

,Name,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,Julie Dsouza,Apple Airpods Headphones,1,150.00,01/22/19 21:20,"868 Willow St, Los Angeles, CA 90001"
1,Kelly Sebastian,Apple Airpods Headphones,1,150.00,01/24/19 8:13,"442 Cedar St, Portland, OR 97035"
2,Daniel Fernandez,27in 4K Gaming Monitor,1,389.99,01/26/19 12:16,"741 10th St, Los Angeles, CA 90001"
3,Julie Dsouza,Bose SoundSport Headphones,1,99.99,01/01/19 10:30,"867 Willow St, Los Angeles, CA 90001"
4,John Jacob,Wired Headphones,2,11.99,01/17/19 13:33,"946 Walnut St, Boston, MA 02215"

In [25]:
def amazon(df, x, y):
    ans = df.groupby('Name').filter(lambda t : (t['Quantity Ordered'].sum() > x) & (t['Price Each'].mean() > y))
    return ans[['Name', 'Purchase Address']]
amazon(df, 1, 100)

           Name                      Purchase Address
0  Julie Dsouza  868 Willow St, Los Angeles, CA 90001
3  Julie Dsouza  867 Willow St, Los Angeles, CA 90001

In [31]:
ans  = list(df['Purchase Address'].str.split(','))   ### splitting address to get three new columns

In [41]:
df['pincode'] = np.array(ans)[:, 2]

In [44]:
df['city'] = np.array(ans)[:, 1]

In [47]:
df['address'] = np.array(ans)[:, 0]

In [49]:
df.drop('Purchase Address', axis=1, inplace = True)

In [50]:
df

,Name,Product,Quantity Ordered,Price Each,Order Date,pincode,city,address
0,Julie Dsouza,Apple Airpods Headphones,1,150.00,01/22/19 21:20,CA 90001,Los Angeles,868 Willow St
1,Kelly Sebastian,Apple Airpods Headphones,1,150.00,01/24/19 8:13,OR 97035,Portland,442 Cedar St
2,Daniel Fernandez,27in 4K Gaming Monitor,1,389.99,01/26/19 12:16,CA 90001,Los Angeles,741 10th St
3,Julie Dsouza,Bose SoundSport Headphones,1,99.99,01/01/19 10:30,CA 90001,Los Angeles,867 Willow St
4,John Jacob,Wired Headphones,2,11.99,01/17/19 13:33,MA 02215,Boston,946 Walnut St

In [54]:
df = df[['Name', 'Product', 'Quantity Ordered', 'Price Each', 'Order Date', 'address', 'city', 'pincode']]  ## rearranging columns

In [55]:
df

,Name,Product,Quantity Ordered,Price Each,Order Date,address,city,pincode
0,Julie Dsouza,Apple Airpods Headphones,1,150.00,01/22/19 21:20,868 Willow St,Los Angeles,CA 90001
1,Kelly Sebastian,Apple Airpods Headphones,1,150.00,01/24/19 8:13,442 Cedar St,Portland,OR 97035
2,Daniel Fernandez,27in 4K Gaming Monitor,1,389.99,01/26/19 12:16,741 10th St,Los Angeles,CA 90001
3,Julie Dsouza,Bose SoundSport Headphones,1,99.99,01/01/19 10:30,867 Willow St,Los Angeles,CA 90001
4,John Jacob,Wired Headphones,2,11.99,01/17/19 13:33,946 Walnut St,Boston,MA 02215

In [59]:
df['Order Date']=pd.to_datetime(df['Order Date'])  # Converting to Datetime to get two columns - Date and time

C:\Users\ROHAN\AppData\Local\Temp\ipykernel_14540\1722919639.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df['Order Date']=pd.to_datetime(df['Order Date'])

In [61]:
df

,Name,Product,Quantity Ordered,Price Each,Order Date,address,city,pincode
0,Julie Dsouza,Apple Airpods Headphones,1,150.00,2019-01-22 21:20:00,868 Willow St,Los Angeles,CA 90001
1,Kelly Sebastian,Apple Airpods Headphones,1,150.00,2019-01-24 08:13:00,442 Cedar St,Portland,OR 97035
2,Daniel Fernandez,27in 4K Gaming Monitor,1,389.99,2019-01-26 12:16:00,741 10th St,Los Angeles,CA 90001
3,Julie Dsouza,Bose SoundSport Headphones,1,99.99,2019-01-01 10:30:00,867 Willow St,Los Angeles,CA 90001
4,John Jacob,Wired Headphones,2,11.99,2019-01-17 13:33:00,946 Walnut St,Boston,MA 02215

In [62]:
df['Date'] = df['Order Date'].dt.date

In [64]:
df['Time'] = df['Order Date'].dt.time

In [65]:
df

,Name,Product,Quantity Ordered,Price Each,Order Date,address,city,pincode,Date,Time
0,Julie Dsouza,Apple Airpods Headphones,1,150.00,2019-01-22 21:20:00,868 Willow St,Los Angeles,CA 90001,2019-01-22,21:20:00
1,Kelly Sebastian,Apple Airpods Headphones,1,150.00,2019-01-24 08:13:00,442 Cedar St,Portland,OR 97035,2019-01-24,08:13:00
2,Daniel Fernandez,27in 4K Gaming Monitor,1,389.99,2019-01-26 12:16:00,741 10th St,Los Angeles,CA 90001,2019-01-26,12:16:00
3,Julie Dsouza,Bose SoundSport Headphones,1,99.99,2019-01-01 10:30:00,867 Willow St,Los Angeles,CA 90001,2019-01-01,10:30:00
4,John Jacob,Wired Headphones,2,11.99,2019-01-17 13:33:00,946 Walnut St,Boston,MA 02215,2019-01-17,13:33:00

In [66]:
df = df[['Name', 'Product', 'Quantity Ordered', 'Price Each', 'Order Date','Date' ,'Time', 'address', 'city', 'pincode']]

In [68]:
df.drop('Order Date', axis=1, inplace =True)

C:\Users\ROHAN\AppData\Local\Temp\ipykernel_14540\1442821136.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.drop('Order Date', axis=1, inplace =True)

In [69]:
df

,Name,Product,Quantity Ordered,Price Each,Date,Time,address,city,pincode
0,Julie Dsouza,Apple Airpods Headphones,1,150.00,2019-01-22,21:20:00,868 Willow St,Los Angeles,CA 90001
1,Kelly Sebastian,Apple Airpods Headphones,1,150.00,2019-01-24,08:13:00,442 Cedar St,Portland,OR 97035
2,Daniel Fernandez,27in 4K Gaming Monitor,1,389.99,2019-01-26,12:16:00,741 10th St,Los Angeles,CA 90001
3,Julie Dsouza,Bose SoundSport Headphones,1,99.99,2019-01-01,10:30:00,867 Willow St,Los Angeles,CA 90001
4,John Jacob,Wired Headphones,2,11.99,2019-01-17,13:33:00,946 Walnut St,Boston,MA 02215

In [71]:
df['Price range'] = pd.cut(df['Price Each'], bins = [0, 100, 200, 300, 400, 500], 
       labels = ['0 to 100', '101 to 200', '201 to 300', '301 to 400', '401 to 500'])  ## pd.cut to get price range

In [94]:
df

,Name,Product,Quantity Ordered,Price Each,Date,Time,address,city,pincode,Price range
0,Julie Dsouza,Apple Airpods Headphones,1,150.00,2019-01-22,21:20:00,868 Willow St,Los Angeles,CA 90001,101 to 200
1,Kelly Sebastian,Apple Airpods Headphones,1,150.00,2019-01-24,08:13:00,442 Cedar St,Portland,OR 97035,101 to 200
2,Daniel Fernandez,27in 4K Gaming Monitor,1,389.99,2019-01-26,12:16:00,741 10th St,Los Angeles,CA 90001,301 to 400
3,Julie Dsouza,Bose SoundSport Headphones,1,99.99,2019-01-01,10:30:00,867 Willow St,Los Angeles,CA 90001,0 to 100
4,John Jacob,Wired Headphones,2,11.99,2019-01-17,13:33:00,946 Walnut St,Boston,MA 02215,0 to 100

In [95]:
'''Question
Given a dataframe containing the distance ran by track runner (in 15 sec) for various attempts.

We want to find

for each runner, count of attempts in which the distance covered by runner was greater than the his/her average distance.
'''

'Question\nGiven a dataframe containing the distance ran by track runner (in 15 sec) for various attempts.\n\nWe want to find\n\nfor each runner, count of attempts in which the distance covered by runner was greater than the his/her average distance.\n'

In [111]:
df = pd.DataFrame({'runner': [1,2,3,4,1,2,3,4,1,2,3,4], 'distance' : [82, 101, 84, 106, 93, 86, 87, 82, 92, 86, 98, 84]})

In [112]:
df

    runner  distance
0        1        82
1        2       101
2        3        84
3        4       106
4        1        93
5        2        86
6        3        87
7        4        82
8        1        92
9        2        86
10       3        98
11       4        84

In [113]:
x = df.groupby('runner')[['distance']].mean().round(2)

In [115]:
df = df.merge(x, on = 'runner')

In [117]:
df['greater'] = df['distance_y'] > df['distance_x']

In [122]:
df

    runner  distance_x  distance_y  greater
0        1          82       89.00     True
1        1          93       89.00    False
2        1          92       89.00    False
3        2         101       91.00    False
4        2          86       91.00     True
5        2          86       91.00     True
6        3          84       89.67     True
7        3          87       89.67     True
8        3          98       89.67    False
9        4         106       90.67    False
10       4          82       90.67     True
11       4          84       90.67     True

In [124]:
df.loc[df['greater'] == True].groupby('runner')[['greater']].agg('count')

        greater
runner
1             1
2             2
3             2
4             2

In [125]:
'''Question
Given a dataset about salesperson and customer orders, the task is to group the data as per salesman_id and customer_id, 
and return a new dataframe with the ord_no count for each salesman_id and customer_id pair.
'''

'Question\nGiven a dataset about salesperson and customer orders, the task is to group the data as per salesman_id and customer_id, \nand return a new dataframe with the ord_no count for each salesman_id and customer_id pair.\n'

In [127]:
data = {
    'ord_no': [70001, 70009, 70002, 70004, 70007, 70005, 70008, 70010, 70003, 70012, 70011, 70013],
    'purch_amt': [150.50, 270.65, 65.26, 110.50, 948.50, 2400.60, 5760.00, 1983.43, 2480.40, 250.45, 75.29, 3045.60],
    'ord_date': ['2012-10-05', '2012-09-10', '2012-10-05', '2012-08-17', '2012-09-10', '2012-07-27', '2012-09-10', '2012-10-10', '2012-10-10', '2012-06-27', '2012-08-17', '2012-04-25'],
    'customer_id': [3005, 3001, 3002, 3009, 3005, 3007, 3002, 3004, 3009, 3008, 3003, 3002],
    'salesman_id': [5002, 5005, 5001, 5003, 5002, 5001, 5001, 5006, 5003, 5002, 5007, 5001]
}

df = pd.DataFrame(data)

In [128]:
df

    ord_no  purch_amt    ord_date  customer_id  salesman_id
0    70001     150.50  2012-10-05         3005         5002
1    70009     270.65  2012-09-10         3001         5005
2    70002      65.26  2012-10-05         3002         5001
3    70004     110.50  2012-08-17         3009         5003
4    70007     948.50  2012-09-10         3005         5002
5    70005    2400.60  2012-07-27         3007         5001
6    70008    5760.00  2012-09-10         3002         5001
7    70010    1983.43  2012-10-10         3004         5006
8    70003    2480.40  2012-10-10         3009         5003
9    70012     250.45  2012-06-27         3008         5002
10   70011      75.29  2012-08-17         3003         5007
11   70013    3045.60  2012-04-25         3002         5001

In [131]:
df.groupby(['salesman_id', 'customer_id'])[['ord_no']].agg('count').reset_index()

   salesman_id  customer_id  ord_no
0         5001         3002       3
1         5001         3007       1
2         5002         3005       2
3         5002         3008       1
4         5003         3009       2
5         5005         3001       1
6         5006         3004       1
7         5007         3003       1

In [132]:
'''Question
Given a dataframe containing student's marks for multiple subjects,

Return a dataframe which contains records of subject-wise highest marks along with their roll number.
'''

"Question\nGiven a dataframe containing student's marks for multiple subjects,\n\nReturn a dataframe which contains records of subject-wise highest marks along with their roll number.\n"

In [133]:
data = {
    'roll_no': [1, 2, 1, 3, 1, 3, 3, 3, 2, 2, 1, 2],
    'subject': ['NN', 'DL', 'ML', 'Prob', 'DL', 'ML', 'DL', 'NN', 'NN', 'Prob', 'Prob', 'ML'],
    'marks': [97, 63, 63, 71, 64, 90, 66, 46, 74, 62, 94, 67]
}

df = pd.DataFrame(data)

In [134]:
df

    roll_no subject  marks
0         1      NN     97
1         2      DL     63
2         1      ML     63
3         3    Prob     71
4         1      DL     64
5         3      ML     90
6         3      DL     66
7         3      NN     46
8         2      NN     74
9         2    Prob     62
10        1    Prob     94
11        2      ML     67

In [143]:
merged = df.groupby('subject')[['marks']].agg({'marks' : 'max'}).reset_index()

In [145]:
res = merged.merge(df, on = ['subject', 'marks'], how = 'inner')

In [146]:
res

  subject  marks  roll_no
0      DL     66        3
1      ML     90        3
2      NN     97        1
3    Prob     94        1

In [147]:
'''Question
Given a dataframe df as input, perform the following steps for preprocessing:

1. Remove the row if all the columns have missing values.
2. Replace the missing values of Roll_ID column with 0 and Name column with "Anonymous".
3. Replace the missing values in Marks column with the median value of the column.
4. Change the numerical columns (Roll_ID and Marks) to int datatype in the output.
5. Reset the index of the dataframe returned as shown in the sample output.

Note: Every column of the input dataframe df is currently of object type.
'''

'Question\nGiven a dataframe df as input, perform the following steps for preprocessing:\n\n1. Remove the row if all the columns have missing values.\n2. Replace the missing values of Roll_ID column with 0 and Name column with "Anonymous".\n3. Replace the missing values in Marks column with the median value of the column.\n4. Change the numerical columns (Roll_ID and Marks) to int datatype in the output.\n5. Reset the index of the dataframe returned as shown in the sample output.\n\nNote: Every column of the input dataframe df is currently of object type.\n'

In [148]:
data = {
    'Roll_ID': ['412', np.nan, '456', np.nan, '434', '429', '418'],
    'Name': ['John', 'Mitra', 'Ritz', np.nan, 'Anny', 'Hema', np.nan],
    'Marks': [np.nan, '32', '25', np.nan, '35', '28', '38']
}

df = pd.DataFrame(data)

In [149]:
df

  Roll_ID   Name Marks
0     412   John   NaN
1     NaN  Mitra    32
2     456   Ritz    25
3     NaN    NaN   NaN
4     434   Anny    35
5     429   Hema    28
6     418    NaN    38

In [150]:
def is_null(x):
    return sum(x.isnull())
df.apply(is_null, axis=1)

0    1
1    1
2    0
3    3
4    0
5    0
6    1
dtype: int64

In [153]:
df['Roll_ID'].fillna(0, inplace = True)

In [155]:
df['Name'].fillna('Anonymous', inplace = True)

In [156]:
df

  Roll_ID       Name Marks
0     412       John   NaN
1       0      Mitra    32
2     456       Ritz    25
3       0  Anonymous   NaN
4     434       Anny    35
5     429       Hema    28
6     418  Anonymous    38

In [158]:
df['Marks'].fillna(df['Marks'].median(), inplace = True)

In [159]:
df

  Roll_ID       Name Marks
0     412       John  32.0
1       0      Mitra    32
2     456       Ritz    25
3       0  Anonymous  32.0
4     434       Anny    35
5     429       Hema    28
6     418  Anonymous    38

In [160]:
df[['Roll_ID', 'Marks']] = df[['Roll_ID', 'Marks']].astype('int')

In [161]:
df.dtypes

Roll_ID     int32
Name       object
Marks       int32
dtype: object

In [168]:
df.dropna(how = 'all', axis = 0)

   Roll_ID       Name  Marks
0      412       John     32
1        0      Mitra     32
2      456       Ritz     25
3        0  Anonymous     32
4      434       Anny     35
5      429       Hema     28
6      418  Anonymous     38